; domain
(define (domain lego)
  (:requirements :strips :typing)
  
  (:types brick)

  (:predicates
    (on_brick ?b1 - brick ?b2 - brick)
    (on_table ?b - brick)
    (clear ?b - brick)
    (holding ?b - brick)
    (pick_area ?b - brick)
    (assembly_area ?b - brick)
    (hand_empty)
  )

  (:action pick 
    :parameters (?b - brick)
    :precondition (and 
                    (hand_empty)
                    (pick_area ?b))
    :effect (and
              (not (pick_area ?b))
              (not (hand_empty))
              (holding ?b)
              (not (on_table ?b))))
    
  (:action place
    :parameters (?b - brick)
    :precondition (and 
                    (holding ?b))
    :effect (and
              (not (holding ?b))
              (assembly_area ?b)
              (hand_empty)
              (on_table ?b)))

  (:action stack
    :parameters (?b1 - brick ?b2 - brick)
    :precondition (and 
                    (holding ?b1) 
                    (clear ?b2) 
                    (assembly_area ?b2))
    :effect (and
              (not (holding ?b1))
              (assembly_area ?b1)
              (not (clear ?b2))
              (hand_empty)
              (on_brick ?b1 ?b2)))
)

; problem
(define (problem task_004)
  (:domain lego)

  (:objects
    brick_1_4x2 brick_2_2x2 - brick
  )

  (:init
    (on_table brick_1_4x2)
    (clear brick_1_4x2)
    (pick_area brick_1_4x2)
    (on_table brick_2_2x2)
    (clear brick_2_2x2)
    (pick_area brick_2_2x2)
    (hand_empty)
  )

  (:goal (and
    (assembly_area brick_1_4x2)
    (assembly_area brick_2_2x2)
    (on_table brick_1_4x2)
    (on_brick brick_2_2x2 brick_1_4x2)
  ))
)

; plan
1. (pick brick_1_4x2)
   deleted: (pick_area brick_1_4x2) (hand_empty) (on_table brick_1_4x2)
   added: (holding brick_1_4x2)
   goals met: 0 of 4
2. (place brick_1_4x2)
   deleted: (holding brick_1_4x2)
   added: (assembly_area brick_1_4x2) (hand_empty) (on_table brick_1_4x2)
   goals met: 2 of 4
3. (pick brick_2_2x2)
   deleted: (pick_area brick_2_2x2) (hand_empty) (on_table brick_2_2x2)
   added: (holding brick_2_2x2)
   goals met: 2 of 4
4. (stack brick_2_2x2 brick_1_4x2)
   deleted: (holding brick_2_2x2) (clear brick_1_4x2)
   added: (assembly_area brick_2_2x2) (hand_empty) (on_brick brick_2_2x2 brick_1_4x2)
   goals met: 4 of 4
